In [6]:
import os.path
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
DATA_PATH = 'data/'

In [11]:
df = pd.read_csv(os.path.join(DATA_PATH, 'train.csv'), encoding='euc-kr', index_col = 0)
df.head(3)

,gender,car,reality,child_num,income_total,income_type,edu_type,family_type,house_type,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,work_phone,phone,email,occyp_type,family_size,begin_month,credit
index,,,,,,,,,,,,,,,,,,,
0,F,N,N,0,202500.0,Commercial associate,Higher education,Married,Municipal apartment,-13899,-4709,1,0,0,0,NaN,2.0,-6.0,1.0
1,F,N,Y,1,247500.0,Commercial associate,Secondary / secondary special,Civil marriage,House / apartment,-11380,-1540,1,0,0,1,Laborers,3.0,-5.0,1.0
2,M,Y,Y,0,450000.0,Working,Higher education,Married,House / apartment,-19087,-4434,1,0,1,0,Managers,2.0,-22.0,2.0

--------------

## [변수에 함수 적용하여 변환하기]

1. 함수 만들기
2. map()을 통해 변수에 적용

In [12]:
### 업무 시작일(DAYS_EMPLOYED)이 0보다 작다면 (-1)을 곱하고 그렇지 않다면 0으로 변환

## 함수 만들기
def plus(x):
    if x<0:
        return x*(-1)
    else:
        return 0

## 변수에 적용
df['employed_plus'] = df.DAYS_EMPLOYED.map(plus)

In [14]:
df['employed_plus'].describe()

count    26457.000000
mean      2198.529538
std       2370.140530
min          0.000000
25%        407.000000
50%       1539.000000
75%       3153.000000
max      15713.000000
Name: employed_plus, dtype: float64

------

## [변수에 lambda 적용하여 변환하기]

1. lambda 함수 생각
2. apply 안에 lambda()을 통해 변수에 적용

In [ ]:
## 나이 구간화
df['age']=(df.DAYS_BIRTH*(-1)/365).apply(lambda x:str(x)[0]+'0')

## 0과 1로 범주화 (업무를 하는 사람과 아닌 사람)
df['employed_bin'] = df.employed_plus.map(lambda x : 0 if x==0 else 1)

----

# [replace를 사용하여 변환]

1. 시리즈에 replace 메소드를 적용하여 변환

In [ ]:
df.gender.replace(['F','M'],[0,1],inplace=True)

------

#### 이 외에도 Label Encoding을 사용한 방법과 pd.cut 등 다양한 방법이 존재한다.